In [2]:
%load_ext sql

In [3]:
%sql sqlite:///data/movies.db3

In [3]:
%%sql sqlite://
CREATE TABLE Movie(
    Movie Name VARCHAR(50) NOT NULL,
    actor VARCHAR(50) NOT NULL, 
    director Name VARCHAR(50) NOT NULL,
    actress VARCHAR(50) NOT NULL,
    year int(4) NOT NULL,
    USERID int  NOT NULL UNIQUE, 
    PRIMARY KEY (USERID)
);

Done.

[]

In [6]:
%%sql sqlite://
INSERT INTO Movie VALUES ('Sparsha', 'SUDEEP','SunilKumarDesai', 'Rekha',2000,1 );
INSERT INTO Movie VALUES ('Prathyartha', 'SUDEEP','Sunil Kumar Desai', 'Rekha',1999,2);
INSERT INTO Movie VALUES ('Vaalee', 'SUDEEP','Mahendar', 'sinchana',2002,3);
INSERT INTO Movie VALUES ('Yada Yada Hi Dharmasya', 'vijay','Viraj', 'shava',2019,4);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [8]:
sqlres = %sql SELECT * from Movie
sqlres

 * sqlite://
Done.

[('Sparsha', 'SUDEEP', 'SunilKumarDesai', 'Rekha', 2000, 1),
 ('Prathyartha', 'SUDEEP', 'Sunil Kumar Desai', 'Rekha', 1999, 2),
 ('Vaalee', 'SUDEEP', 'Mahendar', 'sinchana', 2002, 3),
 ('Yada Yada Hi Dharmasya', 'vijay', 'Viraj', 'shava', 2019, 4)]

In [9]:
sqlres = %sql SELECT movie from Movie
sqlres

 * sqlite://
Done.

[('Sparsha',), ('Prathyartha',), ('Vaalee',), ('Yada Yada Hi Dharmasya',)]

In [10]:
%sql select * from movie where actor='SUDEEP'

 * sqlite://
Done.

[('Sparsha', 'SUDEEP', 'SunilKumarDesai', 'Rekha', 2000, 1),
 ('Prathyartha', 'SUDEEP', 'Sunil Kumar Desai', 'Rekha', 1999, 2),
 ('Vaalee', 'SUDEEP', 'Mahendar', 'sinchana', 2002, 3)]